Repository: yebrahim/fortyhadiths-ios
Catalog: *.lproj/Localizable.strings
Languages: ar

source: Nawawi Hadiths
ar: الأربعون النووية

source: Settings
ar: الإعدادات

source: Language
ar: اللغة

source: Font Size
ar: حجم الخط

# hadith1Id
source: First Hadith
ar: الحديث الأول

# hadith1Summary
source: Actions are by intentions
ar: إنَما الأَعمال بِالنيات

# hadith1Pre
source: It is narrated on the authority of Amir al-Mu'minin (Leader of the Believers), Abu Hafs 'Umar bin al-Khattab (may Allah be pleased with him), who said: I heard the Messenger of Allah (peace be upon him), say:
ar: عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ:

# hadith1Text
source: "Actions are according to intentions, and everyone will get what was intended. Whoever migrates with an intention for Allah and His messenger, the migration will be for the sake of Allah and his Messenger. And whoever migrates for worldly gain or to marry a woman, then his migration will be for the sake of whatever he migrated for."
ar: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: "إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ".

# hadith1Post
source: Related by Bukhari & Muslim
ar: رَوَاهُ إِمَامَا الْمُحَدِّثِينَ أَبُو عَبْدِ اللهِ مُحَمَّدُ بنُ إِسْمَاعِيل بن إِبْرَاهِيم بن الْمُغِيرَة بن بَرْدِزبَه الْبُخَارِيُّ الْجُعْفِيُّ، وَأَبُو الْحُسَيْنِ مُسْلِمٌ بنُ الْحَجَّاج بن مُسْلِم الْقُشَيْرِيُّ النَّيْسَابُورِيُّ رَضِيَ اللهُ عَنْهُمَا فِي صَحِيحَيْهِمَا اللذَينِ هُمَا أَصَحُّ الْكُتُبِ الْمُصَنَّفَةِ.

# hadith2Id
source: Second Hadith
ar: الحديث الثاني

# hadith2Summary
source: Islam, Iman, Ihsan
ar: الإسلام، الإيمان، الإحسان

# hadith2Pre
source: It was narrated on the authority of Umar (may Allah be pleased with him), who said:
ar: عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضًا قَالَ:

# hadith2Text
source: While we were one day sitting with the Messenger of Allah (peace be upon him), there appeared before us a man dressed in extremely white clothes and with very black hair. No traces of journeying were visible on him, and none of us knew him. He sat down close by the Prophet (peace be upon him), rested his knee against his thighs, and said, "O Muhammad! Inform me about Islam." The Messenger of Allah (peace be upon him) said, "Islam is that you should testify that there is no deity except Allah and that Muhammad is His Messenger, that you should perform salah, pay the Zakah, fast during Ramadan, and perform Hajj to the House, if you are able to do so." The man said, "You have spoken truly." We were astonished at his questioning him (the Messenger) and telling him that he was right, but he went on to say, "Inform me about iman." He (the Messenger of Allah) answered, "It is that you believe in Allah and His angels and His Books and His Messengers and in the Last Day, and in qadar (fate), both in its good and in its evil aspects." He said, "You have spoken truly." Then he (the man) said, "Inform me about Ihsan." He (the Messenger of Allah) answered, "It is that you should serve Allah as though you could see Him, for though you cannot see Him yet (know that) He sees you." He said, "Inform me about the Hour." He (the Messenger of Allah) said, "About that, the one questioned knows no more than the questioner." So he said, "Well, inform me about the signs thereof." He said, "They are that the slave-girl will give birth to her mistress, that you will see the barefooted, naked, destitute, the herdsmen of the sheep (competing with each other) in raising lofty buildings." Thereupon the man went of. I waited a while, and then he (the Messenger of Allah) said, "O Umar, do you know who that questioner was?" I replied, "Allah and His Messenger know better." He said, "That was Jibril (the Angel Gabriel). He came to teach you your religion."
ar: "بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ. حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه وسلم. فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ. فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إنْ اسْتَطَعْت إلَيْهِ سَبِيلًا. قَالَ: صَدَقْت. فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ! قَالَ: فَأَخْبِرْنِي عَنْ الْإِيمَانِ. قَالَ: أَنْ تُؤْمِنَ بِاَللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ. قَالَ: صَدَقْت. قَالَ: فَأَخْبِرْنِي عَنْ الْإِحْسَانِ. قَالَ: أَنْ تَعْبُدَ اللَّهَ كَأَنَّك تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك. قَالَ: فَأَخْبِرْنِي عَنْ السَّاعَةِ. قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ. قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا؟ قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ. ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ: يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ؟ ‫‬قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ".

# hadith2Post
source: [Muslim]
ar: [رَوَاهُ مُسْلِمٌ]

# hadith3Id
source: Third Hadith
ar: الحديث الثالث

# hadith3Summary
source: Islam is Built Upon Five
ar: بُني الْإِسلَام عَلَى خمس

# hadith3Pre
source: On the authority of Abdullah ibn Umar ibn Al-Khattab (may Allah be pleased with him) who said: I heard the Messenger of Allah (peace be upon him) say:
ar: عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ:

# hadith3Text
source: Islam has been built on five [pillars]: testifying that there is no god but Allah and that Muhammad is the Messenger of Allah, performing the prayers, paying the Zakah, making the pilgrimage to the House, and fasting in Ramadan.
ar: "بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ".

# hadith3Post
source: [Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith4Id
source: Fourth Hadith
ar: الحديث الرابع

# hadith4Summary
source: Deeds are by Their Final Actions
ar: مراحل الخلق، وسبق الكتاب

# hadith4Pre
source: On the authority of Abdullah ibn Masud (may Allah be pleased with him), who said: The Messenger of Allah (peace be upon him), and he is the truthful and the believed, narrated to us:
ar: حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم - وَهُوَ الصَّادِقُ الْمَصْدُوق ُ-: عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ:

# hadith4Text
source: Verily the creation of each one of you is brought together in his mother's womb for forty days in the form of a drop, then he becomes a clot of blood for a like period, then a morsel of flesh for a like period, then there is sent to him the angel who blows the breath of life into him and who is commanded with four matters: to write down his sustenance, his life span, his actions, and whether he will be happy or unhappy (whether or not he will enter Paradise). By Allah, other than Whom there is no deity, verily one of you performs the actions of the people of Paradise until there is but an arm's length between him and it, and that which has been written overtakes him, and so he acts with the actions of the people of the Hellfire and thus enters it; and verily one of you performs the actions of the people of the Hellfire, until there is but an arm's length between him and it, and that which has been written overtakes him and so he acts with the actions of the people of Paradise and thus he enters it.
ar: "إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ؛ فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا. وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا".

# hadith4Post
source: [Bukhari and Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith5Id
source: Fifth Hadith
ar: الحديث الخامس

# hadith5Summary
source: Rejection of Evil Deeds and Innovations
ar: النهي عن الابتداع في الدين

# hadith5Pre
source: On the authority of the mother of the faithful, 'Aisha (may Allah be pleased with her), who said: The Messenger of Allah (peace be upon him) said:
ar: عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، قَالَتْ: قَالَ: رَسُولُ اللَّهِ صلى الله عليه وسلم:

# hadith5Text
source: He who innovates something in this matter of ours [Islam] that is not of it will have it rejected [by Allah].
ar: "مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ".

# hadith5Post
source: [Bukhari & Muslim] In one version by Muslim it reads: He who does an act which we have not commanded, will have it rejected [by Allah].
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ]. وَفِي رِوَايَةٍ لمُسْلِم: "مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ".

# hadith6Id
source: Sixth Hadith
ar: الحديث السادس

# hadith6Summary
source: Protecting the Heart
ar: البعد عن مواطن الشبهات

# hadith6Pre
source: On the authority of Abu 'Abdullah al-Nu'man bin Bashir (ra) who said: I heard the Messenger of Allah(sas) say:
ar: عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ:

# hadith6Text
source: "The halal is clear and the haram is clear, and between them are matters unclear that are unknown to most people. Whoever is wary of these unclear matters has absolved his religion and honor. And whoever indulges in them has indulged in the haram. It is like a shepherd who herds his sheep too close to preserved sanctuary, and they will eventually graze in it. Every king has a sanctuary, and the sanctuary of Allah is what He has made haram. There lies within the body a piece of flesh. If it is sound, the whole body is sound; and if it is corrupted, the whole body is corrupted. Verily this piece is the heart."
ar: "إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقْد اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ".

# hadith6Post
source: [Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith7Id
source: Seventh Hadith
ar: الحديث السابع

# hadith7Summary
source: The Religion is Naseehah (Sincere Advice)
ar: الدين النصيحة

# hadith7Pre
source: On the authority of Tamim Al-Dari (may Allah be pleased with him), The Prophet (peace be upon him) said:
ar: عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ:

# hadith7Text
source: "The religion is naseehah (sincerity)." We said, "To whom?" He (peace be upon him) said, "To Allah, His Book, His Messenger, and to the leaders of the Muslims and their common folk."
ar: "الدِّينُ النَّصِيحَةُ." قُلْنَا: لِمَنْ؟ قَالَ: "لِلهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ."

# hadith7Post
source: [Muslim]
ar: [رَوَاهُ مُسْلِمٌ].

# hadith8Id
source: Eighth Hadith
ar: الحديث الثامن

# hadith8Summary
source: The Sanctity of a Muslim
ar: حرمة دم المسلم وماله

# hadith8Pre
source: On the authority of Abdullah ibn Umar (may Allah be pleased with him), the Messenger of Allah (peace be upon him) said:
ar: عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ:

# hadith8Text
source: "I have been ordered to fight against the people until they testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah, and until they establish the Salah and pay the Zakah. And if they do so then they will have gained protection from me for their lives and property, unless [they commit acts that are punishable] in accordance to Islam, and their reckoning will be with Allah the Almighty."
ar: "أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ؛ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إلَّا بِحَقِّ الْإِسْلَامِ، وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى".

# hadith8Post
source: [Al-Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith9Id
source: Ninth Hadith
ar: الحديث التاسع

# hadith9Summary
source: Obligations are According to Ability
ar: النهي عن كثرة السؤال والتشدد

# hadith9Pre
source: On the authority of Abu Hurayrah (may Allah be pleased with him) who said: I heard the Messenger of Allah (peace be upon him) say:
ar: عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ:

# hadith9Text
source: "What I have forbidden for you, avoid. What I have ordered you [to do], do as much of it as you can. For verily, it was only their excessive questioning and disagreeing with their Prophets that destroyed [the nations] who were before you."
ar: "مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ".

# hadith9Post
source: [Al-Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith10Id
source: Tenth Hadith
ar: الحديث العاشر

# hadith10Summary
source: Restricting Oneself to the Permissible
ar: سبب إجابة الدعاء

# hadith10Pre
source: On the authority of Abu Hurayrah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said:
ar: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ:

# hadith10Text
source: “Allah the Almighty is good and accepts only that which is good. And verily Allah has commanded the believers to do that which He has commanded the Messengers. So the Almighty has said: "O (you) Messengers! Eat of the tayyibat (good things), and perform righteous deeds" [23:51] and the Almighty has said: "O you who believe! Eat of the lawful things that We have provided you" [2:172]. Then he (peace be upon him) mentioned a man who, having journeyed far, is dishevelled and dusty, and who spreads out his hands to the sky saying, "O Lord! O Lord!" while his food is haram, his drink is haram, his clothing is haram, and he has been nourished with haram, so how can [his supplication] be answered?"
ar: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم: "إنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إلَّا طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ تَعَالَى: "يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا"، وَقَالَ تَعَالَى: "يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ" ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ: يَا رَبِّ! يَا رَبِّ! وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لَهُ؟".

# hadith10Post
source: [Muslim]
ar: [رَوَاهُ مُسْلِمٌ].

# hadith11Id
source: Eleventh Hadith
ar: الحديث الحادي عشر

# hadith11Summary
source: Being Cautious of the Doubtful
ar: اترك ما شككت فيه

# hadith11Pre
source: On the authority of Abu Muhammad al-Hasan ibn Ali ibn Abee Talib (may Allah be pleased with him), the grandson of the Messenger of Allah (peace and blessings of Allah be upon him), and the one much loved by him, who said: I memorized from the Messenger of Allah (peace and blessings of Allah be upon him):
ar: عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: حَفِظْتُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم:

# hadith11Text
source: "Leave what makes you doubtful for what does not."
ar: دَعْ مَا يَرِيبُك إلَى مَا لَا يَرِيبُك".

# hadith11Post
source: Related by Tirmidhi & Nasai
ar: رَوَاهُ التِّرْمِذِيُّ، [وَالنَّسَائِيّ] وَقَالَ التِّرْمِذِيُّ: حَدِيثٌ حَسَنٌ صَحِيحٌ.

# hadith12Id
source: Twelveth Hadith
ar: الحديث الثاني عشر

# hadith12Summary
source: Leaving that Which Does Not Concern You
ar: دع ما لا يعنيك

# hadith12Pre
source: On the authority of Abu Hurayrah (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said:
ar: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم

# hadith12Text
source: "Part of the perfection of one's Islam is his leaving that which does not concern him."
ar: "مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ".

# hadith12Post
source: [Tirmidhi]
ar: حَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ، ابن ماجه.

# hadith13Id
source: Thirteenth Hadith
ar: الحديث الثالث عشر

# hadith13Summary
source: Love for Your Brother What You Love for Yourself
ar: من كمال الإيمان

# hadith13Pre
source: On the authority of Abu Hamzah Anas bin Malik (may Allah be pleased with him) - the servant of the Messenger of Allah (peace and blessings of Allah be upon him) - that the Prophet (peace and blessings of Allah be upon him) said:
ar: عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه وسلم عَنْ النَّبِيِّ صلى الله عليه وسلم قَالَ:

# hadith13Text
source: "None of you will believe until you love for your brother what you love for yourself."
ar: "لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ".

# hadith13Post
source: [Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith14Id
source: Fourteenth Hadith
ar: الحديث الرابع عشر

# hadith14Summary
source: Prohibition of Blood of a Muslim
ar: متى يهدر دم المسلم؟

# hadith14Pre
source: On the authority of Abdullah Ibn Masud (may Allah be pleased with him) who said: The Messenger of Allah (peace be upon him) said:
ar: عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم:

# hadith14Text
source: "It is not permissible to spill the blood of a Muslim except in three [instances]: the married person who commits adultery, a life for a life, and the one who forsakes his religion and separates from the community."
ar: "لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ [يشهد أن لا إله إلا الله، وأني رسول الله] إلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ".

# hadith14Post
source: [Al-Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith15Id
source: Fifteenth Hadith
ar: الحديث الخامس عشر

# hadith15Summary
source: Islamic Manners
ar: إكرام الضيف

# hadith15Pre
source: On the authority of Abu Hurayrah (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said:
ar: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ:

# hadith15Text
source: "Let him who believes in Allah and the Last Day speak good, or keep silent; and let him who believes in Allah and the Last Day be generous to his neighbour; and let him who believes in Allah and the Last Day be generous to his guest."
ar: "مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ".

# hadith15Post
source: Related by Bukhari & Muslim
ar: [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ].

# hadith16Id
source: Sixteenth Hadith
ar: الحديث السادس عشر

# hadith16Summary
source: The Forbiddance of Anger
ar: النهي عن الغضب

# hadith16Pre
source: On the authority of Abu Hurayrah (may Allah be pleased with him):
ar: عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه وسلم أَوْصِنِي. قَالَ:

# hadith16Text
source: “A man said to the Prophet, ‘Give me advice.’ The Prophet, peace be upon him, said, ‘Do not get angry.’ The man asked repeatedly and the Prophet answered each time, ‘Do not get angry.’”
ar: "لَا تَغْضَبْ، فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ".

# hadith16Post
source: [Al-Bukhari & Muslim]
ar: [رَوَاهُ الْبُخَارِيُّ].

# hadith17Id
source: Seventeenth Hadith
ar: الحديث السابع عشر

# hadith17Summary
source: Prescription of Ihsan (Perfection)
ar: الإحسان في كل شيء

# hadith17Pre
source: On the authority of Abu Ya'la Shaddad bin Aws (may Allah be pleased with him), that the Messenger of Allah (peace be upon him) said:
ar: عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ:

# hadith17Text
source: "Verily Allah has prescribed ihsan (perfection) in all things. Thus if you kill, kill well; and if you slaughter, slaughter well. Let each one of you sharpen his blade and let him spare suffering to the animal he slaughters."
ar: "إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ".

# hadith17Post
source: [Muslim]
ar: [رَوَاهُ مُسْلِمٌ].

# hadith18Id
source: Eighteenth Hadith
ar: الحديث الثامن عشر

# hadith18Summary
source: Follow Up a Bad Deed with a Good Deed
ar: الخلق الحسن

# hadith18Pre
source: On the authority of Abu Dharr Jundub ibn Junadah, and Abu 'Abd-ir-Rahman Mu'adh bin Jabal (may Allah be pleased with them) that the Messenger of Allah (peace and blessing of Allah be upon him) said:
ar: عَنْ أَبِي ذَرٍّ جُنْدَبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ:

# hadith18Text
source: "Be conscious of Allah wherever you are. Follow the bad deed with a good one to erase it, and engage others with beautiful character."
ar: "اتَّقِ اللَّهَ حَيْثُمَا كُنْت، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ".

# hadith18Post
source: Related by Tirmidhi
ar: رَوَاهُ التِّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ، وَفِي بَعْضِ النُّسَخِ: حَسَنٌ صَحِيحٌ.

# hadith19Id
source: Nineteenth Hadith
ar: الحديث التاسع عشر

# hadith19Summary
source: Be Mindful of Allah and Allah will Protect You
ar: الإيمان بالقضاء والقدر

# hadith19Pre
source: Abu al-‘Abbas ‘Abdullah bin ‘Abbas(ra) reports:
ar: عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ:
