Repository: yebrahim/fortyhadiths-ios
Catalog: *.lproj/Localizable.strings
Languages: ar

# hadith19Text
source: “One day I was riding (a horse/camel) behind the Prophet, peace and blessings be upon him, when he said, ‘Young man, I will teach you some words. Be mindful of God, and He will take care of you. Be mindful of Him, and you shall find Him at your side. If you ask, ask of God. If you need help, seek it from God. Know that if the whole world were to gather together in order to help you, they would not be able to help you except if God had written so. And if the whole world were to gather together in order to harm you, they would not harm you except if God had written so. The pens have been lifted, and the pages are dry.’”
ar: كُنْت خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمًا، فَقَالَ: يَا غُلَامُ! إنِّي أُعَلِّمُك كَلِمَاتٍ: احْفَظْ اللَّهَ يَحْفَظْك، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَك، إذَا سَأَلْت فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْت فَاسْتَعِنْ بِاَللَّهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوك بِشَيْءٍ لَمْ يَنْفَعُوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَك، وَإِنْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوك بِشَيْءٍ لَمْ يَضُرُّوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْك؛ رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُف".

# hadith19Post
source: Related by Tirmidhi
ar: رَوَاهُ التِّرْمِذِيُّ وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ. وَفِي رِوَايَةِ غَيْرِ التِّرْمِذِيِّ: "احْفَظْ اللَّهَ تَجِدْهُ أمامك، تَعَرَّفْ إلَى اللَّهِ فِي الرَّخَاءِ يَعْرِفُك فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأَك لَمْ يَكُنْ لِيُصِيبَك، وَمَا أَصَابَك لَمْ يَكُنْ لِيُخْطِئَك، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنْ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ يُسْرً".

# hadith20Id
source: Twentieth Hadith
ar: الحديث العشرون

# hadith20Summary
source: Modesty is from Faith
ar: الحياء من الإيمان

# hadith20Pre
source: Abu Mas'ud 'Uqbah bin 'Amr al-Ansari al-Badri(ra) reported that the Messenger of Allah(sas) said:
ar: عَنْ أبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو الْأَنْصَارِيِّ الْبَدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم:

# hadith20Text
source: "Among the early prophetic teachings that have reached people is this: if you do not feel shame, do what you wish.”
ar: "إنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْت".

# hadith20Post
source: [Al-Bukhari]
ar: [رَوَاهُ الْبُخَارِيُّ].
